### Prepin' Data Challenge: 2023 Week1 - The Data Source Bank

<br>
Input the data

In [94]:
import pandas as pd
import numpy as np

df = pd.read_csv('PD2023_WK01.csv')

<br>
Split the Transaction Code to extract the letters at the start of the transaction code. These identify the bank who processes the transaction (help)

- Rename the new field with the Bank code 'Bank'.

In [95]:
df['Bank'] = df['Transaction Code'].str.split("-", expand=True)[0]

<br>
Rename the values in the Online or In-person field, Online of the 1 values and In-Person for the 2 values.

In [96]:
df['Online or In-Person'] = np.where(df['Online or In-Person'] == 1, 'Online', 'In-Person')

<br>
Change the date to be the day of the week

In [97]:
#Coverting 'Transaction Date' into Date Time Format
df['Transaction Date'] = pd.to_datetime(df['Transaction Date'], format = '%d/%m/%Y %H:%M:%S')

df['Transaction Date'] = df['Transaction Date'].dt.day_name()

<br>
Different levels of detail are required in the outputs. You will need to sum up the values of the transactions in three ways:

1. Total Values of Transactions by each bank
2. Total Values by Bank, Day of the Week and Type of Transaction (Online or In-Person)
3. Total Values by Bank and Customer Code

In [98]:
# Total Values of Transactions by each bank
Tran_By_Bank = df.groupby('Bank').agg({'Bank': min, 'Value' :sum})

In [99]:
# Total Values by Bank, Day of the Week and Type of Transaction (Online or In-Person)
Total_Bank_Day_Tran = df.groupby(
                                ['Bank', 'Online or In-Person','Transaction Date']).agg(
                                    {'Bank': min,'Online or In-Person': min , 'Transaction Date':min, 'Value' :sum}
                                )

In [100]:
# Total Values by Bank and Customer Code: min, 
Total_Bank_CC = df.groupby(['Bank', 'Customer Code']).agg({'Bank':min, 'Customer Code':min, 'Value' :sum})

<br>
Output each data file

In [101]:
#Output1
Tran_By_Bank.to_csv('PD2023W1_Out1.csv', index = False)

#Output2
Total_Bank_Day_Tran.to_csv('PD2023W1_Out2.csv', index = False)

#Output3
Total_Bank_CC.to_csv('PD2023W1_Out3.csv', index = False)

In [70]:
#Verifying the outputs

In [102]:
Output1 = pd.read_csv('PD2023W1_Out1.csv')
Output2 = pd.read_csv('PD2023W1_Out2.csv')
Output3 = pd.read_csv('PD2023W1_Out3.csv')

In [103]:
Output1

  Bank   Value
0   DS  653940
1  DSB  530489
2  DTB  618238

In [104]:
Output2.head(10)

  Bank Online or In-Person Transaction Date  Value
0   DS           In-Person           Friday  58599
1   DS           In-Person           Monday  42806
2   DS           In-Person         Saturday  34867
3   DS           In-Person           Sunday  51301
4   DS           In-Person         Thursday  75582
5   DS           In-Person          Tuesday  32607
6   DS           In-Person        Wednesday  63686
7   DS              Online           Friday  58731
8   DS              Online           Monday  33563
9   DS              Online         Saturday  71357

In [105]:
Output3.head(10)

  Bank  Customer Code  Value
0   DS         100000  57909
1   DS         100001  53063
2   DS         100002  69803
3   DS         100003  25482
4   DS         100004  63315
5   DS         100005  39668
6   DS         100006  77636
7   DS         100007  76190
8   DS         100008  56400
9   DS         100009  56581